#+Title: Babel tests with org-tables
** massa de dados
   #+NAME: MassaDeDados
| Pessoa    | classe | p1 | p2 |
| Huguinho  | Pre1   |  6 |  7 |
| Zezinho   | Pre1   |  4 |  2 |
| Luizinho  | Pre2   | 10 | 10 |
| Clarabela | Pre2   |  9 |  9 |

* Trabalhando com dados 
#+CAPTION: lisp
#+NAME: test_lisp_code
#+HEADER: :session test_lisp_code_sess1
#+HEADER: :var table=MassaDeDados 
#+HEADER: :results value list replace
#+HEADER: :exports both
#+BEGIN_SRC emacs-lisp
(length table)
(mapc (lambda (x) (message (car x) (cadr x))) table)
#+END_SRC


** Coisas mais legais com R
#+CAPTION: bloco1 R
#+NAME: R count and perc
#+HEADER: :session R_Session1
#+HEADER: :var orgTable=MassaDeDados
#+HEADER: :results output  table  replace 
#+HEADER: :exports both
#+BEGIN_SRC R :colnames yes
  classesCount <- table(orgTable$classe)
  classesPerc <- table(orgTable$classe)/4
  classesCount
  classesPerc
#+END_SRC

#+RESULTS: R_Session_GettingTheTable
: 
: Pre1 Pre2 
:    2    2
: 
: Pre1 Pre2 
:  0.5  0.5

#+CAPTION: bloco2 R
#+NAME: R count and perc GRAF
#+HEADER: :session R_Session1
#+HEADER: :var data1=1 :var data2=2 :var data3=3
#+HEADER: :results output  table  replace 
#+HEADER: :exports both
#+BEGIN_SRC R
  classesCount
  classesPerc
#+END_SRC

#+RESULTS: R count and perc GRAF
: Erro: objeto 'classesCount' não encontrado
: Erro: objeto 'classesPerc' não encontrado



#+NAME: R_orgTable_export_html
#+HEADER: :session R_Session_GettingTheTable
#+HEADER: :var orgTable=MassaDeDados
#+HEADER: :results output  html  replace 
#+HEADER: :exports both
#+BEGIN_SRC R :colnames yes
  tbl <- ftable(orgTable$classe)
  tbl
#+END_SRC

#+RESULTS: R_orgTable_export_html
#+BEGIN_EXPORT html
 Pre1 Pre2
          
    2    2
#+END_EXPORT


** Coisas mais legais com Python
#+CAPTION: bloco2 python (Utiliza Resultado do Bloco1)
#+NAME: python_code2
#+HEADER: :session pythonSess1
#+HEADER: :results file
#+HEADER: :exports both
#+BEGIN_SRC python
import sys
import matplotlib.pyplot as plt
#sys.version_info
plt.plot([1,2,3,4])
plt.ylabel('some numbers')
#plt.show()
fig=plt.figure(figsize=(4,2))
gfig.tight_layout()
#+END_SRC

#+RESULTS: python_code2




